# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Install ZSH
# brew 'zsh' after Catalina this is default 
brew 'z'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'zlib' # Needed for Memcached


# Development
brew 'terraform'
brew 'maven'
brew 'npm'
brew 'yarn'

# Apps
# cask '1password'
# cask 'aerial'
# cask 'alfred'
# cask 'bartender'
# cask 'caffeine' I instal Amphetamine via app store 
# cask 'discord'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-backup-and-sync'
#cask 'google-chrome'
#cask 'gpg-suite'
#cask 'insomnia'
cask 'postman'
cask 'java'
# cask 'slack' UNCOMMENT NEXT TIME remove from App Store section
# cask 'rectangle' UNCOMMENT NEXT TIME
cask 'dropbox'
cask 'cheatsheet'
cask 'amazon-chime'
cask 'spotify'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
#mas 'Slack', id: 803453959
#mas 'Keynote', id: 409183694
#mas 'Numbers', id: 409203825
#mas 'Xcode', id: 497799835
